package 조건문_코테;
import java.util.Scanner;

/*
행사 안내 메일 발송하기

---

1. 사용자로부터 이름, 제목, 날짜(20230817), 시간(17) 정보를 입력받습니다.
2. 입력된 날짜의 월을 추출하여 해당하는 계절을 판단합니다.
3. 계절에 따라 적절한 인사말과 입력된 일정 정보를 출력합니다.

---

프로그램은 다음과 같은 방식으로 동작해야 합니다.

- 1월부터 12월까지의 월 정보를 입력 받습니다.
- 입력된 월에 따라 다음과 같은 계절 정보를 출력합니다.
    - 12월, 1월, 2월 → "한파의 연속인 1월 입니다."
    - 3월 → "봄의 기운이 느껴지는 3월 입니다."
    - 4월 → "새싹이 피어나는 4월 입니다."
    - 5월 → "계절의 여왕 5월 입니다."
    - 6월 → "활동하기 좋은 6월 입니다."
    - 7월 → "휴가가 기다려지는 7월 입니다."
    - 8월 → "무더운 8월 입니다."
    - 9월 → "선선한 9월 입니다."
    - 10월 → "천고마비의 계절 10월 입니다."
    - 11월 → "쓸쓸한 늦가을 11월 입니다."
- 입력된 이름, 제목, 날짜, 시간 정보와 계절 정보를 이용하여 다음과 같은 형식으로 일정 정보를 출력합니다.

*/

public class Test_email {
    public static void main(String[] args) {

        String name;
        String season;
        String title;
        int month;

        Scanner sc = new Scanner(System.in);
        System.out.print("이름 : ");





//        System.out.print(name + "님.");
//        System.out.print(season);
//        System.out.print("아래와 같은 일정으로" + title + "을 진행하고자 하오니 오셔서 자리를 빛내주시기 바랍니다.");

    }
}
